src/config/InformationRegisters/Файлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>Файлы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Добавлен</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХЗ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Статья</v8:Type>
						<v8:Type>cfg:CatalogRef.Пароли</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Скрытый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/config/InformationRegisters/Файлы/Ext/ManagerModule.bsl
Процедура ЗаписатьФайлы (МассивПриложений, Ссылка, Скрытый) Экспорт
	
	Набор = РегистрыСведений.Файлы.СоздатьНаборЗаписей();
	Набор.Отбор.Документ.Установить(Ссылка);
	Набор.Отбор.Скрытый.Установить(Скрытый);
	Набор.Прочитать();
	Набор.Очистить();

	
	Для каждого Стр Из МассивПриложений Цикл
		АдресВХранилище = Стр.Путь;
		ВыбранноеИмяФайла = Стр.Имя;
		
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВХранилище);
		//НовСтр = Вложения.Добавить();
		//НовСтр.ХЗ = Новый ХранилищеЗначения(ДвоичныеДанные);
		//
		//ОчищенноеИмяФайла = ВыбранноеИмяФайла;
		//Поз = 10;
		//Пока Поз > 0 Цикл
		//	Поз1 = Найти(ОчищенноеИмяФайла, "\");
		//	Поз2 = Найти(ОчищенноеИмяФайла, "/");
		//	Поз = Макс(Поз1, Поз2);
		//	Если Поз > 0 Тогда
		//		ОчищенноеИмяФайла = Прав(ОчищенноеИмяФайла, СтрДлина(ОчищенноеИмяФайла) - Поз);
		//	КонецЕсли;
		//КонецЦикла;
		//
		//НовСтр.ИмяФайла = ОчищенноеИмяФайла;
		//НовСтр.ТипФайла = "";
		//НовСтр.Добавлен = ТекущаяДата();
		//НовСтр.Пользователь = ПараметрыСеанса.ТекущийПользователь;
		//НовСтр.Размер = ДвоичныеДанные.Размер() / 1024;
		
		ЗаписьФС = Набор.Добавить();
		ЗаписьФС.Документ = Ссылка;
		ЗаписьФС.ХЗ = Новый ХранилищеЗначения(ДвоичныеДанные);
		ЗаписьФС.ИмяФайла = ВыбранноеИмяФайла;
		ЗаписьФС.Скрытый = Скрытый;
		ЗаписьФС.Добавлен = ТекущаяДата();
		ЗаписьФС.Пользователь = ПараметрыСеанса.ТекущийПользователь;
		ЗаписьФС.Размер = ДвоичныеДанные.Размер() / 1024;
		
	КонецЦикла; 	
	
	Набор.Записать();	
	
КонецПроцедуры

Процедура ЗаписатьФайл (ВыбранноеИмяФайла, Ссылка, АдресВХранилище) Экспорт
	
	ЗаписьФС = РегистрыСведений.Файлы.СоздатьМенеджерЗаписи();
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВХранилище);
	ОчищенноеИмяФайла = ВыбранноеИмяФайла;
	Поз = 10;
	Пока Поз > 0 Цикл
		Поз1 = Найти(ОчищенноеИмяФайла, "\");
		Поз2 = Найти(ОчищенноеИмяФайла, "/");
		Поз = Макс(Поз1, Поз2);
		Если Поз > 0 Тогда
			ОчищенноеИмяФайла = Прав(ОчищенноеИмяФайла, СтрДлина(ОчищенноеИмяФайла) - Поз);
		КонецЕсли;
	КонецЦикла;

	ЗаписьФС.Документ = Ссылка;
	ЗаписьФС.ХЗ = Новый ХранилищеЗначения(ДвоичныеДанные);
	ЗаписьФС.ИмяФайла = ОчищенноеИмяФайла;
	ЗаписьФС.Скрытый = Ложь;
	ЗаписьФС.Добавлен = ТекущаяДата();
	ЗаписьФС.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	ЗаписьФС.Размер = ДвоичныеДанные.Размер() / 1024;
	
	ЗаписьФС.Записать();	
	
КонецПроцедуры

Функция ПрочитатьФайлы(УИД, Ссылка) Экспорт
		
	Струк = Новый Структура("Приложения, ПрикрепленныеКартинки", Новый Массив, Новый Массив);
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Файлы.Документ,
		|	Файлы.ИмяФайла,
		|	Файлы.Скрытый,
		|	Файлы.Добавлен,
		|	Файлы.Пользователь,
		|	Файлы.Размер,
		|	Файлы.ХЗ
		|ИЗ
		|	РегистрСведений.Файлы КАК Файлы
		|ГДЕ
		|	Файлы.Документ = &Документ";
		
		Запрос.УстановитьПараметр("Документ", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ВыборкаДетальныеЗаписи.Скрытый = Истина Тогда
				АдресВХранилище = ПоместитьВоВременноеХранилище(ВыборкаДетальныеЗаписи.ХЗ.Получить(), УИД);
				//КаталогВременныхФайлов() + "МенеджерБТИ\" + 
				ИмяФайла = ВыборкаДетальныеЗаписи.ИмяФайла;
				Струк.ПрикрепленныеКартинки.Добавить(Новый ОписаниеПередаваемогоФайла(ИмяФайла, АдресВХранилище)); 	
			Иначе
				Струк.Приложения.Добавить(Новый Структура("ИмяФайла",ИмяФайла));
			КонецЕсли; 
 
		КонецЦикла; 
	КонецЕсли; 	
	
	Возврат Струк;
	
КонецФункции

Функция ПрочитатьФайл(Струк, УИД) Экспорт
	
	АдресВХранилище = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Файлы.Документ,
		|	Файлы.ИмяФайла,
		|	Файлы.Скрытый,
		|	Файлы.Пользователь,
		|	Файлы.Добавлен,
		|	Файлы.Размер,
		|	Файлы.ХЗ
		|ИЗ
		|	РегистрСведений.Файлы КАК Файлы
		|ГДЕ
		|	Файлы.Документ = &Документ
		|	И Файлы.ИмяФайла = &ИмяФайла";
	
	Запрос.УстановитьПараметр("Документ", Струк.Документ);
	Запрос.УстановитьПараметр("ИмяФайла", Струк.ИмяФайла);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		АдресВХранилище = ПоместитьВоВременноеХранилище(Выборка.ХЗ.Получить(), УИД);
	КонецЕсли;
	
	Возврат АдресВХранилище;
	
КонецФункции
